<template>
	<div>
		<div class="pop-pay" @click.stop>
			<div class="wave-wp">
				<div class="wave1"></div>
				<div class="wave2"></div>
				<div class="wave3"></div>
			</div>
			<a href="#" class="back" title="返回">
				<i class="icon-pay icon-pay-back" ></i>
			</a>
			<h3><span>充值</span></h3>
			<div class="pay-amount">
				<p>
					<span>购买物品：</span>
					<span>{{payGoods}}</span>
				</p>
				<p>
					<span>赠送物品：</span>
					<span>{{paySend}}</span>
				</p>
				<p>
					<span>支付金额：</span>
					<strong>{{payAmount}}</strong>
				</p>
				<p>
					<a href="#" class="ckbox on">
						<i class="icon-pay icon-pay-ck"></i>
					</a>
					<span>使用优惠券：</span><span>暂无可用优惠券</span>
					<a href="#" class="more">更多优惠券&gt;</a>
				</p>
			</div>
			<div class="pay-way">
				<p>请选择充值方式</p>
				<div class="pay-btn-wp">
					<a href="javascript:;" v-for="(val,index) in payWay" :class="{on:val.isSelt}" @click="pay(index)">
						<i class="icon-pay" :class="val.way"></i> 
						<i class="icon-pay icon-pay-selt"></i>
					</a>
				</div>
				<a href="#" class="btn-recharge" title="充值">立即充值</a>
				<p>
					<a href="#" class="ckbox on">
						<i class="icon-pay icon-pay-ck"></i>
					</a>
					我已阅读并同意<a href="javascript:;" id="agreement" @click="agreementShow">《猜猜乐用户协议》</a>
				</p>
			</div>
		</div>

		<div class="pop-agreement" v-show="showAgreement">
			<a href="#" class="icon icon-close" @click="showAgreement=false"></a>
			<h3>猜猜乐用户协议</h3>
			<div class="pop-agreement-cont">
				<p>《猜猜乐用户协议》（以下简称“本协议”）由您与猜猜乐活动服务方，即深圳市迅雷网络技术有限公司一同签订，本协议具有合同效力。请您仔细阅读各条款内容。</p>
				<p>除非您已阅读并接受本协议所有条款，否则您无权参与猜猜乐活动服务。您使用猜猜乐活动服务即视为您已阅读并同意签订本协议。</p>
				<h4>一、定义和说明</h4>
				<ul>
					<li>1)  本协议：指本协议正文，协议内容一经发布即正式生效。</li>
					<li>2)  迅雷猜猜乐活动为迅雷会员运营的用户回馈活动。</li>
					<li>3)  猜猜乐活动服务提供方：指向您提供猜猜乐活动及其服务的深圳市迅雷网络技术有限公司，在本协议中简称为“迅雷”。</li>
					<li>4)	活动规则：指迅雷猜猜乐不定时发布并修订的关于猜猜乐的活动规则、玩家条例、活动公告及通知等。</li>
					<li>5)	猜猜乐活动：指由迅雷猜猜乐负责运营的活动统称，包括但不限于计算机客户端网页活动、移动端网页活动等形式。</li>
					<li>6)	猜猜乐活动服务：指迅雷向您提供的与活动相关的各项服务。</li>
					<li>7)	您：指被授权使用猜猜乐活动及其服务的用户。</li>
					<li>8)	活动数据：指您在参与猜猜乐活动过程中产生的被服务器记录的各种数据，包括参与活动日志、安全日志等数据。</li>
				</ul>
				<h4>二、猜猜乐活动服务</h4>
				<ul>
					<li>1)	在您遵守本协议及相关法律法规的前提下， 您允许以非商业目的使用猜猜乐活动服务，包括：
						<ul>
							<li>a)	登录、显示、运行、参与猜猜乐活动；</li>
							<li>b)	创建活动账号、查阅活动规则、用户账户记录、活动参与结果，在活动中购买、使用活动道具、活动币等，使用聊天功能、社交分享功能；</li>
						</ul>
					</li>
					<li>2)	如果迅雷发现或收到他人举报或投诉用户违反本协议约定的，迅雷有权不经通知随时对相关内容进行删除，并视行为情节对违规活动账号处以处罚（包括但不限于警告、限制或禁止使用全部或部分功能、活动账号封禁），并公告处理结果。</li>
					<li>3)	迅雷有对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。</li>
					<li>4)	因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；迅雷因此遭受的损失，您也应当一并赔偿。</li>
					<li>5)	活动道具、活动金币等是猜猜乐活动服务的一部分。您购买、使用活动道具、活动币等时应遵循本协议、活动具体规则的要求；同时，活动道具、活动金币等若有有效期限的限制，且您在规定有效期内未使用，除不可抗力或可归责于迅雷的原因外，一旦有效期满，将会自动失效。</li>
					<li>6)	为保证您及其他用户的参与活动的进度，迅雷有权定期转移或者清除猜猜乐活动服务器上存储的一些历史数据。</li>
					<li>7)	迅雷将按照相关法律法规和本协议的规定，采取切实有效的措施保护未成年人在参与猜猜乐活动过程中的合法权益，包括可能采取技术措施、禁止未成年人接触不适宜的活动或者活动功能、限制未成年人的活动时间、预防未成年人沉迷网络。作为活动规则的一部分，迅雷还将在适当位置发布猜猜乐活动用户指引和警示说明，包括活动内容介绍、正确参与活动的方法以及防止危害发生的方法。所有未成年人用户都应在法定监护人的指导下仔细阅读并遵照执行这些指引和说明；其他玩家在参与猜猜乐活动的过程中应避免发布、产生任何有损未成年人身心健康的内容，共同营造健康活动环境。</li>
				</ul>
				<h4>三、用户行为规范</h4>
				<ul>
					<li>1)	您必须为自己账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对猜猜乐活动中的内容自行加以判断，并承担因参与猜猜乐活动而引起的所有风险。迅雷不对因前述风险而导致的任何损失承担责任。</li>
					<li>2)	您除了可以按照本协议的约定使用猜猜乐活动服务之外，不得进行任何侵犯猜猜乐活动的知识产权的行为，或者进行其他的有损于迅雷或其他第三方合法权益的行为。</li>
					<li>3)	除非迅雷书面许可，您不得从事以下行为, 若您在参与猜猜乐活动过程中有如下行为的，迅雷将视情节严重程度，依据本协议及相关活动规则的规定，对您做出暂时或永久性地禁止登录、删除活动账号及活动数据、删除相关信息等处理措施，情节严重的将移交有关行政管理机关给予行政处罚，或者追究您的刑事责任：
						<ul>
							<li>a)	对活动进行扫描、检测等手段，以企图发现其中可能存在的BUG；</li>
							<li>b)	复制、翻录、反编译、反汇编、传播和陈列迅雷猜猜乐活动的程序</li>
							<li>c)	在活动运行过程中，包括但不限于使用插件、外挂或非经合法授权的第三方工具/服务接入活动和相关系统；</li>
							<li>d)	修改或伪造活动运行中的指令、数据，变动活动的功能或运行效果，或将上述方法向公众传播；</li>
							<li>e)	以暗示或伪称迅雷内部员工或某种特殊身份，企图得到不正当利益或影响其他用户权益的行为；</li>
							<li>f)	在猜猜乐使用非法或不当词语、字符，或传播非法言论及不当信息；</li>
							<li>g)	以任何方式破坏猜猜乐活动或影响猜猜乐活动服务的正常进行；</li>
							<li>h)	盗取他人活动账号、活动物品；</li>
							<li>i)	私自进行活动账号、活动道具、活动币等交易；</li>
						</ul>
					</li>
				</ul>
				<h4>四、协议的变更和生效</h4>
				<ul>
					<li>1)	迅雷有权在必要时变更本协议条款，并在相关页面进行通知。您可以在猜猜乐活动的相关页面查阅最新版本的协议条款。</li>
					<li>2)	本协议条款变更后，若您继续参与猜猜乐活动，即视为您已接受变更后的协议。若您不接受变更后的协议，应停止参与猜猜乐活动。</li>
				</ul>
				<h4>五、免责声明</h4>
				<ul>
					<li>1)	迅雷不保证：猜猜乐活动服务无错误及不会中断、所有缺陷已被更正、或猜猜乐活动不会受到病毒或任何其它因素的损害。除非有法律明确规定，迅雷在此明确声明不承担任何的担保责任。</li>
					<li>2)	迅雷可独立决定随时变更、终止、中止您对任何猜猜乐活动的参与，无须向您发出任何提前通知，但根据法律法规规定或您与迅雷的约定需要提前通知的除外。若因您的行为违反法律法规的规定或本协议的规定，迅雷根据相关规定终止、中止您使用任何猜猜乐活动服务，则迅雷无须向您承担任何责任，且有权要求您承担相应的责任。</li>
					<li>3)	猜猜乐活动可能因活动BUG、版本更新缺陷、第三方病毒攻击或其他任何因素导致您的活动道具、活动币等账号数据发生异常。在数据异常的原因未得到查明前，迅雷有权暂时冻结该活动账号；若查明数据异常为非正常活动行为，迅雷有权恢复活动账号数据至异常发生前的状态，且无须向您承担任何责任。</li>
					<li>4)	迅雷未授权您从任何第三方通过购买、接受赠与或者其他的方式获得活动账号、活动道具、活动装备、活动币等，迅雷不对第三方交易的行为负责，并且不受理因任何第三方交易发生纠纷而带来的申诉。</li>
				</ul>
				<h4>六、管辖与法律适用</h4>
				<ul>
					<li>1)	本协议签订地为中华人民共和国广东省深圳市南山区，若发生纠纷，需在本协议签订地法院解决。</li>
					<li>2)	本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</li>
					<li>3)	本协议条款无论因何种原因部分无效，其余条款仍有效，对各方具有约束力。</li>
				</ul>
				<p>迅雷网络技术有限公司</p>
			</div>
		</div>
	</div>
</template>

<script>
	export default{
		name:"Pay",
		data() {
			return {
				payGoods:"迅雷会员10元代金券*1+5元代金券*1",
				paySend:"1000金币",
				payAmount:"10元",
				payWay:[
					{
						way:"icon-pay-alipay",
						isSelt:true
					},
					{
						way:"icon-pay-wx",
						isSelt:false
					}
				],
				showAgreement:false
			}
		},
		methods:{
			pay(index){	
				for(let i=0;i<this.payWay.length;i++){
					this.payWay[i].isSelt=false;
				}
				this.payWay[index].isSelt=true;
			},
			agreementShow(){
				this.showAgreement=true;	
			}

		}
	}
</script>